import React, { useEffect, useRef } from 'react';
import './CompanyIntro.css'; // Import your CSS file

import DiyarahLogo from '/Images/Icons/icon4.png'

import Building1  from '/Images/Buildingds/Building1.webp'
import Building2  from '/Images/Buildingds/Building2.webp'
import Building3  from '/Images/Buildingds/Building3.webp'

const CompanyIntro = () => {
  const professionalIntroRef = useRef(null);

  useEffect(() => {
    const handleAnimation = (entries, observer) => {
      entries.forEach(entry => {
        if (entry.isIntersecting) {
          entry.target.classList.add('animate');
          observer.unobserve(entry.target);
        }
      });
    };

    const introObserver = new IntersectionObserver(handleAnimation, {
      threshold: 0.5,
    });

    if (professionalIntroRef.current) {
      introObserver.observe(professionalIntroRef.current);
    }

    return () => {
      if (professionalIntroRef.current) {
        introObserver.unobserve(professionalIntroRef.current);
      }
    };
  }, []);

  return (
    <div className="professional-intro-container">
        <h1>من نحن و ما هي قيمنا</h1>
      <div className="professional-intro-section">
        <div id='alogoDiv'>
            <img src={DiyarahLogo} alt="Logo" className="alogo" loading="lazy" />
        </div>
        <p id='heroP'>
          شركة ديارة للتطوير والاستثمار العقاري هي شركة رائدة في مجال التطوير العقاري في المملكة. تأسست الشركة برؤية واضحة لتعزيز استدامة النمو في قطاع العقارات وتحقيق أهداف رؤية المملكة 2030.
          تعمل شركة ديارة على تنفيذ وتطوير مشاريع عقارية متنوعة في مختلف القطاعات، بما في ذلك السكنية والتجارية والفندقية والصناعية. تعتمد الشركة على أحدث التقنيات والممارسات العالمية في مجال التطوير العقاري لتقديم منتجات عالية الجودة ومبتكرة.
          تلتزم شركة ديارة بمعايير عالية من حيث الجودة والاستدامة البيئية في جميع مشاريعها. تسعى الشركة لتحقيق التوازن بين الاحتياجات الحالية والمستقبلية للمجتمع والبيئة، وذلك من خلال تبني ممارسات تصميم وبناء مستدامة واستخدام مواد وتقنيات صديقة للبيئة.
          بفضل اهتمامها بالتنمية المستدامة، تساهم شركة ديارة في تعزيز الاقتصاد المحلي وتوفير فرص العمل وتحسين جودة الحياة للمجتمع المحلي. كما تساهم في تعزيز البنية التحتية العقارية وتعزيز النمو الاقتصادي للمملكة.
          تعتبر شركة ديارة رائدة في إحداث التغيير الإيجابي في قطاع العقارات وتحقيق أهداف التنمية المستدامة في المملكة. من خلال رؤيتها الواضحة والتزامها بالجودة والاستدامة، تعد شركة ديارة شريكًا استراتيجيًا في تحقيق التطور العقاري وتحقيق رؤية المملكة 2030.
        </p>
      </div>
      {/* Section 1 */}
      <div className="professional-intro-section">
        <div className="professional-intro-text">
          <h2>أهداف الشركة</h2>
          <p>
              أهداف شركة ديارة للتطوير والاستثمار العقاري تتمحور حول عدة جوانب رئيسية، وتشمل:
          </p>
          <ul>
              <li>
                  <strong>تعزيز التطوير العقاري:</strong> تهدف الشركة إلى تنفيذ وتطوير مشاريع عقارية متنوعة في مختلف القطاعات، بما في ذلك السكنية والتجارية والفندقية والصناعية. تسعى الشركة لتعزيز الابتكار وتقديم منتجات وخدمات عقارية عالية الجودة وملائمة لاحتياجات السوق.
              </li>
              <li>
                  <strong>دعم رؤية المملكة 2030:</strong> تسعى شركة ديارة للمساهمة في تحقيق أهداف رؤية المملكة 2030، التي تهدف إلى تحويل المملكة العربية السعودية إلى اقتصاد متنوع ومستدام. تسعى الشركة للعمل على تنمية البنية التحتية العقارية وتعزيز الاستثمارات وتوفير فرص العمل في القطاع العقاري.
              </li>
              <li>
                  <strong>الاستدامة البيئية والاجتماعية:</strong> تعتزم شركة ديارة تحقيق التوازن بين الاحتياجات الحالية للمجتمع والبيئة والاحتياجات المستقبلية. تلتزم الشركة بمعايير عالية من حيث الجودة والاستدامة البيئية في جميع مشاريعها. تسعى الشركة لاستخدام ممارسات تصميم وبناء مستدامة وتبني تقنيات ومواد صديقة للبيئة.
              </li>
              <li>
                  <strong>تعزيز الاقتصاد المحلي:</strong> تعتبر شركة ديارة شريكًا استراتيجيًا في تعزيز الاقتصاد المحلي. من خلال تنفيذ مشاريع عقارية وتوفير فرص العمل وتعزيز البنية التحتية العقارية، تساهم الشركة في تعزيز النمو الاقتصادي وتحسين جودة الحياة للمجتمع المحلي.
              </li>
          </ul>
        </div>
        <img
          src= {Building1}
          alt="Professional Image 1"
          className="animated-image"
          id='Building1'
          loading="lazy"
        />
      </div>

      {/* Section 2 */}
      <div className="professional-intro-section reverse">
        <img
          src={Building2}
          alt="Professional Image 2"
          className="animated-image"
          id='Building2'
          loading="lazy"
        />
        <div className="professional-intro-text">
          <h2>الرؤية و الرسالة</h2>
          <p>
              رؤية شركة ديارة للتطوير والاستثمار العقاري هي تحقيق التميز في قطاع العقارات وتكون شركة رائدة ومرجعية في مجال التطوير العقاري في المملكة العربية السعودية والمنطقة بشكل عام. تسعى الشركة لتحقيق التطور العقاري وتعزيز الاستثمارات وتنمية البنية التحتية العقارية بما يسهم في تعزيز التنمية المستدامة وتحقيق أهداف رؤية المملكة 2030.
          </p>
          <p>
              تعتمد رؤية شركة ديارة على عدة مبادئ أساسية، وتشمل:
          </p>
          <ul>
              <li>
                  <strong>التميز والجودة:</strong> تسعى الشركة لتحقيق أعلى مستويات التميز في جميع جوانب أعمالها، بدءًا من تصميم المشاريع وحتى تنفيذها وتسويقها. تهدف الشركة إلى تقديم منتجات وخدمات ذات جودة عالية تلبي تطلعات العملاء وتفوق توقعاتهم.
              </li>
              <li>
                  <strong>الاستدامة:</strong> تلتزم شركة ديارة بمفهوم الاستدامة في جميع جوانب أعمالها. تسعى الشركة للتوازن بين الاحتياجات الحالية والمستقبلية للمجتمع والبيئة، وذلك من خلال تبني ممارسات تصميم وبناء مستدامة واستخدام مواد وتقنيات صديقة للبيئة.
              </li>
              <li>
                  <strong>التطوير المستدام:</strong> تهدف شركة ديارة إلى تحقيق التطور العقاري المستدام وتعزيز الاستثمارات في القطاع العقاري. تعمل الشركة على تطوير مشاريع مبتكرة تلبي احتياجات السوق وتساهم في تعزيز النمو الاقتصادي وتحسين جودة الحياة في المجتمع.
              </li>
          </ul>
        </div>
      </div>

      {/* Section 3 */}
      <div className="professional-intro-section">
        <div className="professional-intro-text">
        <h2>الخدمات</h2>
        <ol>
            <li>
                <strong>تطوير المشاريع العقارية:</strong> تعمل الشركة على تطوير مشاريع سكنية وتجارية وفندقية وصناعية. تشمل المشاريع السكنية إنشاء وتطوير المجمعات السكنية والفيلات والشقق السكنية. أما المشاريع التجارية فتشمل إنشاء وتطوير المراكز التجارية والمجمعات التجارية والمتاجر والمكاتب. كما تتضمن المشاريع الفندقية إقامة وتطوير الفنادق والمنتجعات السياحية. ويشمل التطوير الصناعي إنشاء وتطوير المجمعات والمصانع الصناعية.
            </li>
            <li>
                <strong>التسويق العقاري:</strong> تقوم شركة ديارة بتسويق المشاريع العقارية التي تطورها. تعمل الشركة على ترويج المشاريع وتسويقها للعملاء المحتملين، سواء كانوا مستثمرين أو مشترين محتملين للعقارات. تقدم الشركة خدمات التسويق الشاملة بما في ذلك استشارات التسويق والترويج والعروض التقديمية والتسويق الإلكتروني.
            </li>
            <li>
                <strong>إدارة المشاريع:</strong> توفر شركة ديارة خدمات إدارة المشاريع العقارية. تشمل هذه الخدمات إدارة جميع جوانب المشروع من التخطيط والتصميم والتنفيذ والمراقبة وإدارة الموارد والجدولة والميزانية. تهدف الشركة إلى ضمان تنفيذ المشاريع بفعالية وجودة عالية وفي الوقت المحدد.
            </li>
            <li>
                <strong>استشارات العقارات:</strong> تقدم شركة ديارة خدمات استشارية في مجال العقارات. يمكن للعملاء الحصول على استشارات فيما يتعلق بالاستثمار العقاري وتقييم العقارات وتحليل السوق والتخطيط العقاري وإدارة المخاطر وغيرها من الخدمات الاستشارية.
            </li>
            <li>
                <strong>إدارة العقارات:</strong> توفر شركة ديارة خدمات إدارة العقارات للعملاء. تتضمن هذه الخدمات إدارة العقارات السكنية والتجارية والفندقية والصناعية. تشمل المهام الرئيسية لإدارة العقارات تأجير الوحدات وجمع الإيجارات وصيانة العقارات وإدارة العلاقات مع المستأجرين والعملاء.
            </li>
        </ol>
        </div>
        <img
          src={Building3}
          alt="Professional Image 3"
          className="animated-image"
          id='Building3'
          loading="lazy"
        />
      </div>
    </div>
  );
};

export default CompanyIntro;
